ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/ЖБИ_Маршрут/ЖБИ_Маршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖБИ_Маршрут</name>
  <comment>ЖБИ - Маршрут</comment>
  <attributes>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктНазначения</name>
    <comment>Пункт назначения</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/ЖБИ_Маршрут/ManagerModule.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция СоздатьМаршрутДляРасчетаСтавки(ПунктОтгрузки,ПунктНазначения,МаршрутСсылка,СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктОтгрузки",ПунктОтгрузки);
	Запрос.УстановитьПараметр("ПунктНазначения",ПунктНазначения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_Маршрут.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЖБИ_Маршрут КАК ЖБИ_Маршрут
	               |ГДЕ
	               |	ЖБИ_Маршрут.ПунктОтгрузки = &ПунктОтгрузки
	               |	И ЖБИ_Маршрут.ПунктНазначения = &ПунктНазначения";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		МаршрутСсылка = РезультатЗапроса.Ссылка;
	Иначе 
		СпрОбъект = Справочники.ЖБИ_Маршрут.СоздатьЭлемент();
		СпрОбъект.УстановитьНовыйКод();
		СпрОбъект.ПунктОтгрузки = ПунктОтгрузки;
		СпрОбъект.ПунктНазначения = ПунктНазначения;
		Попытка
			СпрОбъект.Записать();
			МаршрутСсылка = СпрОбъект.Ссылка;
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Функция ПолучитьМаршрутПоОтбору(ПунктОтгрузки,ПунктНазначения) Экспорт
	
	МаршрутСсылка = Справочники.ЖБИ_Маршрут.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктОтгрузки",ПунктОтгрузки);
	Запрос.УстановитьПараметр("ПунктНазначения",ПунктНазначения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_Маршрут.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЖБИ_Маршрут КАК ЖБИ_Маршрут
	               |ГДЕ
	               |	ЖБИ_Маршрут.ПунктОтгрузки = &ПунктОтгрузки
	               |	И ЖБИ_Маршрут.ПунктНазначения = &ПунктНазначения";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		МаршрутСсылка = РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат МаршрутСсылка;
	
КонецФункции

#КонецОбласти
